routes_and_controllers/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        artwork_shares = ArtworkShare.all

INSERT INTO "artwork_shares" ("viewer_id", "created_at", "updated_at", "artwork_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["viewer_id", 3], ["created_at", "2021-04-01 14:26:37.694205"], ["updated_at", "2021-04-01 14:26:37.694205"], ["artwork_id", 1]]
---
    def create
        artwork_share = ArtworkShare.new(artwork_share_params)
        if artwork_share.save