routes_and_controllers/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 1], ["LIMIT", 1]]
SELECT artworks.* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE "users"."id" = $1  [["id", "2"]]
SELECT artworks.* FROM "artworks" LEFT OUTER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 2]]
---
    def index
        if params.has_key?(:user_id)
            artworks = {}
            artworks[:artworks_owned] = Artwork.find_by(artist_id: params[:user_id])
            artworks[:shared] = Artwork.select('artworks.*')
            .joins(:shared_viewers)
            .where(users: { id: params[:user_id] } )
            # .left_outer_joins(:artwork_shares)
            # .where(artwork_shares: { viewer_id: params[:user_id] } )
        else
            artworks = Artwork.all

INSERT INTO "artworks" ("title", "created_at", "updated_at", "image_url", "artist_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Anxious Men"], ["created_at", "2021-03-31 21:23:30.120231"], ["updated_at", "2021-03-31 21:23:30.120231"], ["image_url", "www.anxiousmen.com"], ["artist_id", 5]]
---
    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 AND "artworks"."artist_id" = $2 LIMIT $3  [["id", 2], ["artist_id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", true], ["updated_at", "2021-04-01 19:57:12.818183"], ["id", 2]]
---
    def favorite
        # debugger
        artwork = Artwork.find_by(id: params[:id], artist_id: params[:user_id])
        # debugger
        artwork.favorite = true
        artwork.save