routes_and_controllers/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments"
---
    def index
        case
        when params[:user_id]
                comments = Comment.where(user_id: params[:user_id])
        when params[:artwork_id]
                comments = Comment.where(artwork_id: params[:artwork_id])
        else
            comments = Comment.all